{"keyword": "diabetes", "search_results": [{"title": "Diabetes: What It Is, Causes, Symptoms, Treatment & Types", "url": "https://my.clevelandclinic.org/health/diseases/7104-diabetes", "snippet": "Diabetes is a condition that happens when your blood sugar (glucose) is too high. It develops when your pancreas doesn't make enough insulin or any at all."}, {"title": "Diabetes Research, Education, Advocacy | ADA", "url": "https://diabetes.org/", "snippet": "Leading the fight against the deadly consequences of diabetes for those affected by it through research funding, community services, education and advocacy."}, {"title": "Diabetes - Symptoms and causes - Mayo Clinic", "url": "https://www.mayoclinic.org/diseases-conditions/diabetes/symptoms-causes/syc-20371444", "snippet": "Diabetes mellitus refers to a group of diseases that affect how the body uses blood sugar (glucose)."}, {"title": "Diabetes - World Health Organization (WHO)", "url": "https://www.who.int/news-room/fact-sheets/detail/diabetes", "snippet": "Diabetes is a chronic disease that occurs either when the pancreas does not produce enough insulin or when the body cannot effectively use the insulin it ..."}, {"title": "What Is Diabetes? - NIDDK", "url": "https://www.niddk.nih.gov/health-information/diabetes/overview/what-is-diabetes", "snippet": "Diabetes occurs when your blood glucose is too high, which can lead to health problems. The main types of diabetes are type 1, type 2, and gestational."}], "page_summaries": [{"url": "https://my.clevelandclinic.org/health/diseases/7104-diabetes", "title": "Diabetes", "summary": "Diabetes is a chronic condition characterized by high blood glucose (hyperglycemia) due to insufficient insulin production (by the pancreas), insulin resistance, or both. Common types include Type 2 (most prevalent, involving insulin resistance), Type 1 (autoimmune destruction of insulin-producing cells), prediabetes (intermediate stage), and gestational diabetes (develops during pregnancy). Symptoms may include polydipsia, polyuria, fatigue, blurred vision, and slow-healing wounds; complications include cardiovascular disease, neuropathy, nephropathy, and retinopathy. Management involves blood glucose monitoring, lifestyle modifications (diet, exercise), oral medications (e.g., metformin), and insulin therapy, with goals to prevent complications and maintain glycemic control."}, {"url": "https://diabetes.org/", "title": "Diabetes Research, Education, Advocacy | ADA", "summary": "Diabetes is a condition with multiple types, including Type 1, Type 2, and Gestational Diabetes. Key aspects covered include warning signs, symptoms, prediabetes (a precursor state), prevention strategies, complications, and management through education, treatment, and lifestyle adjustments. Statistics indicate over 38 million Americans are affected, with 1.2 million new diagnoses annually and 97.6 million adults living with prediabetes. Tools like the Type 2 Diabetes Risk Test and resources for healthy eating, fitness, and medication management are available to support individuals living with diabetes."}, {"url": "https://www.mayoclinic.org/diseases-conditions/diabetes/symptoms-causes/syc-20371444", "title": "Diabetes - Symptoms and causes", "summary": "Diabetes mellitus is a group of diseases affecting blood sugar (glucose) utilization, characterized by excess blood sugar due to insufficient insulin or insulin ineffectiveness, leading to serious health complications. Chronic types include type 1 (autoimmune, insulin deficiency) and type 2 (insulin resistance, more common), while reversible forms are prediabetes (elevated but sub-diabetic glucose) and gestational diabetes (during pregnancy). Symptoms may include polyuria, polydipsia, unintended weight loss, fatigue, blurred vision, slow-healing sores, and infections, with type 1 symptoms typically acute and severe, and type 2/prediabetes/gestational often asymptomatic initially. Long-term complications involve cardiovascular disease, neuropathy, nephropathy, retinopathy, and increased infection risk, with prevention/treatment focusing on lifestyle modifications (diet, exercise, weight management) and medications (e.g., metformin for prediabetes/type 2)."}, {"url": "https://www.who.int/news-room/fact-sheets/detail/diabetes", "title": "Diabetes", "summary": "NO_RELEVANT_INFO"}, {"url": "https://www.niddk.nih.gov/health-information/diabetes/overview/what-is-diabetes", "title": "What Is Diabetes?", "summary": "Diabetes is a disease characterized by abnormally high blood glucose levels due to insufficient insulin production, impaired insulin action, or both, preventing glucose from entering cells for energy. Common types include type 1 (autoimmune destruction of pancreatic insulin-producing cells, requiring daily insulin), type 2 (insulin resistance with potential insufficient insulin, linked to obesity/family history), gestational (develops during pregnancy, often resolves post-delivery but increases future type 2 risk), and prediabetes (elevated glucose not meeting diabetes criteria, high type 2 risk). It increases risk of damage to eyes, kidneys, nerves, heart, and certain cancers; management involves controlling blood glucose, blood pressure, and cholesterol, with type 2 potentially preventable/delayable via lifestyle modifications."}], "final_description": "Diabetes is a chronic metabolic disorder characterized by abnormally high blood glucose (hyperglycemia) resulting from insufficient insulin production, impaired insulin action (insulin resistance), or both, which prevents glucose from entering cells to be used for energy. Key types include Type 1 diabetes (autoimmune destruction of pancreatic insulin-producing cells, requiring daily insulin), Type 2 diabetes (the most prevalent form, involving insulin resistance often with progressive insulin deficiency, linked to obesity and family history), gestational diabetes (develops during pregnancy, typically resolving post-delivery but increasing future Type 2 risk), and prediabetes (an intermediate state with elevated glucose levels not meeting diabetes criteria, associated with high Type 2 risk). Clinical features may include polyuria, polydipsia, fatigue, blurred vision, slow-healing wounds, and unintended weight loss (more acute in Type 1), while Type 2, prediabetes, and gestational diabetes often present asymptomatically initially. Long-term complications involve damage to the eyes (retinopathy), kidneys (nephropathy), nerves (neuropathy), heart (cardiovascular disease), and increased infection and certain cancer risks. Management focuses on maintaining glycemic control through blood glucose monitoring, lifestyle modifications (diet, exercise, weight management), and medications (e.g., metformin for prediabetes/Type 2), with Type 2 potentially preventable or delayable via these interventions.", "success": true, "from_cache": false}
{"keyword": "Urinary tract infection", "search_results": [{"title": "Urinary tract infection (UTI) - Symptoms and causes - Mayo Clinic", "url": "https://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/symptoms-causes/syc-20353447", "snippet": "UTIs occur when bacteria enter the urinary tract through the urethra and begin to spread in the bladder. The urinary system is designed to keep ..."}, {"title": "Urinary Tract Infection (UTI): Causes, Symptoms & Treatment", "url": "https://my.clevelandclinic.org/health/diseases/9135-urinary-tract-infections", "snippet": "Symptoms include needing to pee often, pain while peeing and pain in your side or lower back. Antibiotics can treat most UTIs."}, {"title": "Urinary Tract Infection(UTI): Symptoms, Diagnosis & Treatment", "url": "https://www.urologyhealth.org/urology-a-z/u/urinary-tract-infections-in-adults", "snippet": "Symptoms · Burning or pain when you pee · Feeling like you have to pee all the time, even when little urine comes out · Cloudy, dark, or foul-smelling urine ..."}, {"title": "Uncomplicated Urinary Tract Infections - StatPearls - NCBI Bookshelf", "url": "https://www.ncbi.nlm.nih.gov/books/NBK470195/", "snippet": "An uncomplicated urinary tract infection (UTI) is a bacterial infection of the bladder and associated structures."}, {"title": "Urinary Tract Infection Basics - CDC", "url": "https://www.cdc.gov/uti/about/index.html", "snippet": "UTIs are common infections that happen when bacteria, often from the skin or rectum, enter the urethra and infect the urinary tract."}], "page_summaries": [{"url": "https://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/symptoms-causes/syc-20353447", "title": "Urinary tract infection (UTI) - Symptoms and causes", "summary": "A urinary tract infection (UTI) is an infection affecting any part of the urinary system (kidneys, ureters, bladder, urethra), most commonly involving the lower tract (bladder, urethra). It occurs when bacteria (often E. coli) enter the urethra and multiply in the bladder, with women at higher risk due to shorter urethra and hormonal changes. Symptoms include dysuria, urinary urgency/frequency, hematuria, and pelvic pain; kidney involvement causes back pain, fever, nausea/vomiting. UTIs are treated with antibiotics, and complications like kidney damage or sepsis may occur if untreated. Prevention includes fluid intake, avoiding irritants, and managing risk factors like constipation or incomplete bladder emptying."}, {"url": "https://my.clevelandclinic.org/health/diseases/9135-urinary-tract-infections", "title": "Urinary Tract Infection (UTI)", "summary": "A urinary tract infection (UTI) is an infection of the urinary system, involving the urethra (urethritis), bladder (cystitis), or kidneys (pyelonephritis), most commonly caused by bacteria like E. coli. Symptoms include frequent urination, dysuria, flank/abdominal pain, cloudy/foul-smelling urine, and may progress to fever, chills, or nausea if involving the kidneys. Diagnosis is via urinalysis (detecting nitrites, leukocyte esterase) and urine culture, with treatment typically involving antibiotics such as nitrofurantoin, sulfamethoxazole/trimethoprim, or cephalexin; completion of the full antibiotic course is critical to prevent recurrence or antibiotic resistance. Prevention strategies include good hygiene (front-to-back wiping), adequate fluid intake, urinating before/after sex, and avoiding irritants like spermicides or tight clothing."}, {"url": "https://www.urologyhealth.org/urology-a-z/u/urinary-tract-infections-in-adults", "title": "Urinary Tract Infection(UTI): Symptoms, Diagnosis & Treatment", "summary": "A urinary tract infection (UTI) is an infection caused by germs (usually bacteria) entering the bladder, urethra, or kidneys. Symptoms include burning during urination, frequent urination, cloudy/foul-smelling urine, lower abdominal pain, and, if kidneys are involved, fever, chills, nausea, or back pain. Risk factors include female anatomy (shorter urethra), sexual activity, postmenopausal estrogen decline, diabetes, urinary blockages, and catheter use. Diagnosis involves urine testing and culture; treatment typically uses antibiotics (3-7 days for uncomplicated cases), with IV antibiotics for kidney involvement. Prevention strategies include increased fluid intake, avoiding spermicides, cranberry products (for some), vaginal estrogen (postmenopausal women), and methenamine hippurate (prescription)."}, {"url": "https://www.ncbi.nlm.nih.gov/books/NBK470195/", "title": "Uncomplicated Urinary Tract Infections", "summary": "A urinary tract infection (UTI) is a bacterial infection typically involving the lower urinary tract (bladder and associated structures), caused primarily by _Escherichia coli_ ascending from the perineum/rectum. Key symptoms include urinary frequency, urgency, dysuria, and suprapubic discomfort; diagnosis relies on clinical history, urinalysis (detecting nitrites, leukocyte esterase, pyuria), and urine culture (≥1000 CFU/mL in symptomatic patients). Treatment involves first-line antibiotics like nitrofurantoin, trimethoprim/sulfamethoxazole, or fosfomycin, with duration 3-7 days (longer for men), aiming to relieve symptoms and prevent progression to pyelonephritis. Risk factors include female sex, sexual activity, urinary catheter use, and antibiotic exposure."}, {"url": "https://www.cdc.gov/uti/about/index.html", "title": "Urinary Tract Infection Basics", "summary": "A urinary tract infection (UTI) is a common infection caused by bacteria (often from the skin or rectum) entering the urethra and infecting the urinary tract, which includes the bladder, urethra, and kidneys. Common types are bladder infections (cystitis, most common) and kidney infections (pyelonephritis, more serious). Symptoms include pain/burning during urination, frequent urination, and for kidney infections, fever, chills, and back pain. Risk factors include female gender (shorter urethra), previous UTI, sexual activity, and age (young children/older adults). Treatment involves antibiotics prescribed by a healthcare provider; prevention includes urinating after sex, staying hydrated, and proper hygiene (e.g., front-to-back wiping)."}], "final_description": "A urinary tract infection (UTI) is a bacterial infection affecting any part of the urinary system, most commonly the lower tract (bladder, urethra) as cystitis, with more serious involvement of the kidneys as pyelonephritis. It typically occurs when bacteria, primarily Escherichia coli from the perineum or rectum, ascend the urethra and multiply, with risk factors including female sex (due to shorter urethra), sexual activity, urinary catheter use, diabetes, and postmenopausal estrogen decline. Clinical features include urinary frequency, urgency, dysuria, suprapubic or pelvic pain, cloudy/foul-smelling urine, and hematuria; kidney involvement may present with fever, chills, back pain, nausea, or vomiting. Diagnosis relies on clinical history, urinalysis (detecting nitrites, leukocyte esterase, pyuria), and urine culture (≥1000 CFU/mL in symptomatic patients). Treatment involves antibiotics, such as nitrofurantoin, trimethoprim/sulfamethoxazole, or fosfomycin, with 3–7 days for uncomplicated lower tract infections (longer courses for men or kidney involvement), and completion of the full course is critical to prevent recurrence or progression to sepsis. Prevention strategies include adequate fluid intake, front-to-back wiping, urinating before/after sex, avoiding irritants like spermicides, cranberry products (for some), vaginal estrogen (postmenopausal women), and methenamine hippurate (prescription).", "success": true, "from_cache": false}
{"keyword": "chronic heart failure", "search_results": [{"title": "Congestive Heart Failure: Symptoms, Stages & Treatment", "url": "https://my.clevelandclinic.org/health/diseases/17069-heart-failure-understanding-heart-failure", "snippet": "Congestive heart failure is a long-term condition that happens when your heart can't pump blood well enough to give your body a normal supply."}, {"title": "Heart failure - Symptoms and causes - Mayo Clinic", "url": "https://www.mayoclinic.org/diseases-conditions/heart-failure/symptoms-causes/syc-20373142", "snippet": "Heart failure occurs when the heart muscle doesn't pump blood as well as it should. When this happens, blood often backs up and fluid can build up in the lungs ..."}, {"title": "Heart Failure (Congestive Heart Failure) - StatPearls - NCBI Bookshelf", "url": "https://www.ncbi.nlm.nih.gov/books/NBK430873/", "snippet": "Heart failure (HF), also known as congestive heart failure (CHF), is a complex clinical syndrome characterized by the heart's inability to pump blood ..."}, {"title": "Congestive Heart Failure | CHF - MedlinePlus", "url": "https://medlineplus.gov/heartfailure.html", "snippet": "Heart failure, or congestive heart failure (CHF), means the heart can't pump enough blood. Learn about the signs, symptoms and causes."}, {"title": "Chronic Heart Failure: Symptoms, Causes and Treatment | Ada", "url": "https://ada.com/conditions/chronic-heart-failure/", "snippet": "The most common symptoms of chronic heart failure include shortness of breath, tiredness, swelling of the legs and ankles, chest pain and a cough."}], "page_summaries": [{"url": "https://my.clevelandclinic.org/health/diseases/17069-heart-failure-understanding-heart-failure", "title": "Congestive Heart Failure: What Does It Mean?", "summary": "Chronic heart failure, also referred to as congestive heart failure, is a long-term condition where the heart cannot pump blood sufficiently to meet the body's needs, leading to fluid accumulation in the lungs, legs, and other tissues. It is a progressive disorder, often worsening over time, with four stages (A to D) ranging from high risk to advanced disease. Symptoms include shortness of breath, fatigue, swelling, and weight gain, managed through medications (e.g., ACE inhibitors, beta-blockers, diuretics), lifestyle modifications (low-sodium diet, exercise), and advanced treatments like heart transplant or ventricular assist devices in severe cases. It is a life-limiting condition, with survival rates decreasing over time (e.g., 80-90% at 1 year, 30% at 10 years)."}, {"url": "https://www.mayoclinic.org/diseases-conditions/heart-failure/symptoms-causes/syc-20373142", "title": "Heart failure - Symptoms and causes", "summary": "Chronic heart failure occurs when the heart muscle is weakened, damaged, or stiff, impairing its ability to pump blood effectively. It often results from conditions like coronary artery disease, high blood pressure, or heart attack, leading to fluid buildup (e.g., in lungs, legs) and symptoms such as shortness of breath, fatigue, and swelling. Key types include heart failure with reduced ejection fraction (HFrEF, weakened pumping) and preserved ejection fraction (HFpEF, impaired filling). Proper treatment (medications, lifestyle changes) may improve symptoms and survival, though severe cases may require heart transplant or mechanical support devices."}, {"url": "https://www.ncbi.nlm.nih.gov/books/NBK430873/", "title": "Heart Failure (Congestive Heart Failure)", "summary": "Chronic heart failure (CHF), also known as heart failure (HF), is a complex clinical syndrome characterized by the heart's inability to pump blood effectively due to structural or functional impairments, with common causes including ischemic heart disease, hypertension, valvular disease, and myocarditis. It is classified by left ventricular ejection fraction (LVEF) into subtypes like HFrEF (≤40%), HFmrEF (41-49%), HFpEF (≥50%), and HFimpEF (>40% from ≤40%), and staged clinically via ACC/AHA stages (A-D) and NYHA functional classes (I-IV). Symptoms include shortness of breath, fatigue, fluid retention, edema, orthopnea, and paroxysmal nocturnal dyspnea, with physical exam findings such as jugular venous distention, pulmonary rales, S3 gallop, and peripheral edema. Pathophysiologically, it involves progressive maladaptive compensatory mechanisms like sympathetic nervous system and RAAS activation leading to myocardial remodeling, and management requires a multifaceted approach including patient education, medication (e.g., RAAS inhibitors, beta-blockers), and interprofessional care to relieve congestion, stabilize hemodynamics, and improve outcomes."}, {"url": "https://medlineplus.gov/heartfailure.html", "title": "Heart Failure", "summary": "Chronic heart failure is a condition where the heart cannot pump enough oxygen-rich blood to meet the body's needs, typically developing slowly from long-term medical conditions (e.g., coronary artery disease, high blood pressure, diabetes). It can affect the left side (inability to pump blood out to the body due to weakness or stiffness) or right side (inability to pump blood to the lungs for oxygen), with left-sided being more common. Symptoms include shortness of breath, fatigue, edema (swelling), coughing, and difficulty sleeping flat, worsening as the disease progresses. Treatment involves medications, dietary changes (reduced sodium/fluid), lifestyle modifications, and may include devices (e.g., pacemakers, ventricular assist devices) or heart transplant in severe cases, though there is no cure and lifelong management is required."}, {"url": "https://ada.com/conditions/chronic-heart-failure/", "title": "Chronic Heart Failure: Symptoms, Causes and Treatment | Ada", "summary": "Chronic heart failure is an ongoing condition where the heart cannot pump enough blood to meet the body's oxygen needs, often due to weakness or stiffness of the heart muscle, and does not mean the heart has stopped. Common risk factors include old age, diabetes, high blood pressure, and being overweight, with higher prevalence in men. Key symptoms include shortness of breath, tiredness, leg/ankle swelling, chest pain, and cough, varying by type (HFrEF with reduced ejection fraction or HFpEF with preserved ejection fraction) and affected ventricle. Treatment involves lifestyle changes (smoking cessation, weight loss, salt restriction), medications (ACE inhibitors, beta blockers, diuretics), and in severe cases, devices or surgery; it is a long-term, incurable condition managed to control symptoms."}], "final_description": "Chronic heart failure (CHF), also referred to as congestive heart failure, is a progressive, life-limiting clinical syndrome characterized by the heart’s inability to pump blood sufficiently to meet the body’s metabolic demands, resulting from structural or functional impairments such as weakened, damaged, or stiff heart muscle. Pathophysiologically, it involves maladaptive compensatory mechanisms like sympathetic nervous system and renin-angiotensin-aldosterone system (RAAS) activation, leading to myocardial remodeling and fluid accumulation (congestion) in the lungs, legs, and other tissues. Common causes include coronary artery disease, hypertension, valvular disease, and prior heart attack, and it is classified by left ventricular ejection fraction (LVEF) into subtypes: HFrEF (≤40%), HFmrEF (41-49%), HFpEF (≥50%), and HFimpEF (>40% from ≤40%), with clinical staging via ACC/AHA stages (A-D) and NYHA functional classes (I-IV). Clinical features include symptoms such as shortness of breath (exertional, orthopnea, paroxysmal nocturnal dyspnea), fatigue, fluid retention (edema), and physical exam findings like jugular venous distention, pulmonary rales, S3 gallop, and peripheral edema. Management requires a multifaceted approach, including patient education, lifestyle modifications (low-sodium diet, exercise, weight management), and medications (e.g., RAAS inhibitors, beta-blockers, diuretics), with advanced treatments like ventricular assist devices or heart transplant reserved for severe cases to relieve congestion, stabilize hemodynamics, and improve outcomes.", "success": true, "from_cache": false}
{"keyword": "peripheral arterial disease", "search_results": [{"title": "Peripheral artery disease (PAD) - Symptoms and causes - Mayo Clinic", "url": "https://www.mayoclinic.org/diseases-conditions/peripheral-artery-disease/symptoms-causes/syc-20350557", "snippet": "Peripheral artery disease (PAD) is a common condition in which narrowed arteries reduce blood flow to the arms or legs. This condition also may be called ..."}, {"title": "Peripheral Artery Disease (PAD) - Cleveland Clinic", "url": "https://my.clevelandclinic.org/health/diseases/17357-peripheral-artery-disease-pad", "snippet": "Peripheral artery disease (PAD) is a vascular condition where arteries in your legs, pelvic area or arms become narrowed or blocked, usually due to plaque ..."}, {"title": "Peripheral Artery Disease - Society for Vascular Surgery", "url": "https://vascular.org/your-vascular-health/vascular-conditions/common-conditions/peripheral-artery-disease", "snippet": "Peripheral Artery Disease (PAD) is a chronic condition where plaque builds up in the arteries that carry blood to your legs."}, {"title": "About Peripheral Arterial Disease (PAD) - CDC", "url": "https://www.cdc.gov/heart-disease/about/peripheral-arterial-disease.html", "snippet": "Peripheral arterial disease (PAD) in the legs or lower extremities is the narrowing or blockage of the vessels that carry blood from the heart to the legs."}, {"title": "Peripheral Arterial Disease - StatPearls - NCBI Bookshelf - NIH", "url": "https://www.ncbi.nlm.nih.gov/books/NBK430745/", "snippet": "Peripheral arterial disease (PAD) is a circulatory problem causing a reduced blood flow through the arteries."}], "page_summaries": [{"url": "https://www.mayoclinic.org/diseases-conditions/peripheral-artery-disease/symptoms-causes/syc-20350557", "title": "Peripheral artery disease (PAD) - Symptoms and causes", "summary": "Peripheral arterial disease (PAD), also called peripheral artery disease, is a condition where narrowed arteries reduce blood flow to the arms or legs, typically due to atherosclerosis (plaque buildup). Symptoms include leg pain/cramping during exercise (claudication), coldness, numbness, weak pulses, slow-healing sores, and skin changes. Risk factors include diabetes, hypertension, high cholesterol, smoking, and aging. Complications include critical limb ischemia (tissue death) and increased risk of heart attack/stroke. Treatment involves lifestyle modifications (exercise, smoking cessation, healthy diet) and managing underlying conditions."}, {"url": "https://my.clevelandclinic.org/health/diseases/17357-peripheral-artery-disease-pad", "title": "What Is Peripheral Artery Disease?", "summary": "Peripheral arterial disease (PAD) is a vascular condition characterized by narrowing or blockage of arteries in the limbs (most commonly legs) due to atherosclerosis (plaque buildup), limiting blood flow. Clinical manifestations include leg discomfort during activity (intermittent claudication) that resolves with rest, and severe cases may present with rest pain, ulcers, or tissue necrosis. Diagnosis involves the ankle-brachial index (ABI), vascular ultrasound, and angiographic imaging. Management includes lifestyle modifications (smoking cessation, exercise), medications (antiplatelets, statins, vasodilators), and procedures (angioplasty, atherectomy, bypass surgery) to prevent complications like limb loss and associated cardiovascular events."}, {"url": "https://vascular.org/your-vascular-health/vascular-conditions/common-conditions/peripheral-artery-disease", "title": "Peripheral Artery Disease | Society for Vascular Surgery", "summary": "Peripheral Arterial Disease (PAD), also known as peripheral vascular occlusive disease (PVOD), peripheral arterial occlusive disease (PAOD), \"hardening\" of the arteries, or peripheral atherosclerosis, is a chronic condition characterized by plaque buildup in arteries supplying the legs, narrowing or blocking blood flow. Symptoms include asymptomatic early stages, claudication (pain/cramping during activity, resolving with rest), rest pain (especially at night), non-healing foot ulcers, leg numbness/weakness, coldness, skin discoloration, and slow nail/hair growth. Risk factors include older age, male sex, smoking, diabetes, hypertension, high cholesterol, obesity, and family history. Diagnosis involves the ankle-brachial index (ABI), arterial Doppler, or angiogram; treatments include lifestyle modifications (exercise, smoking cessation), medication, and procedures like atherectomy, angioplasty, stenting, or surgical bypass to prevent complications such as amputation."}, {"url": "https://www.ncbi.nlm.nih.gov/books/NBK430745/", "title": "Peripheral Arterial Disease", "summary": "Peripheral arterial disease (PAD) is a circulatory disorder characterized by reduced blood flow through arteries, primarily due to atherosclerosis, leading to narrowed arterial lumens and compromised perfusion to extremities. Common symptoms include intermittent claudication (thigh/calf pain with exertion, relieved by rest), and severe cases may present with ischemic rest pain, non-healing ulcers, or gangrene. Diagnosis involves clinical assessment and objective tests like the ankle-brachial index (ABI < 0.9). Management includes lifestyle modifications (smoking cessation, exercise), risk factor reduction, pharmacotherapy (cilostazol, statins), endovascular interventions, and surgery for advanced disease, with PAD indicating systemic atherosclerosis and increased cardiovascular risk."}], "final_description": "Peripheral arterial disease (PAD), also referred to as peripheral artery disease, peripheral vascular occlusive disease, or peripheral arterial occlusive disease, is a chronic circulatory disorder characterized by reduced blood flow to the extremities (most commonly the legs) due to atherosclerosis, which causes plaque buildup in arterial walls, narrowing the lumens and compromising perfusion. Clinically, PAD manifests with a spectrum of symptoms: early stages may be asymptomatic, while classic features include intermittent claudication (thigh, calf, or leg pain/cramping during exertion that resolves with rest); severe cases progress to ischemic rest pain (especially at night), non-healing ulcers, skin discoloration, coldness, numbness, weak pulses, slow nail/hair growth, or tissue necrosis (gangrene). Diagnosis involves clinical assessment and objective tests, most notably the ankle-brachial index (ABI < 0.9), along with vascular ultrasound, arterial Doppler, or angiographic imaging. Management focuses on addressing systemic atherosclerosis and preventing complications (e.g., amputation, heart attack, stroke) through lifestyle modifications (smoking cessation, exercise, healthy diet), risk factor reduction (controlling diabetes, hypertension, high cholesterol), pharmacotherapy (antiplatelets, statins, vasodilators like cilostazol), and, for advanced disease, endovascular interventions (angioplasty, stenting, atherectomy) or surgical bypass. PAD is strongly associated with systemic atherosclerosis, indicating increased cardiovascular risk beyond limb complications.", "success": true, "from_cache": false}
{"keyword": "intranasal vasoconstrictors", "search_results": [{"title": "Effect of Intranasal Vasoconstrictors on Blood Pressure - PubMed", "url": "https://pubmed.ncbi.nlm.nih.gov/30195946/", "snippet": "Intranasal vasoconstrictors did not significantly increase blood pressure in patients without a history of hypertension."}, {"title": "THE USE AND ABUSE OF NASAL VASOCONSTRICTOR ...", "url": "https://jamanetwork.com/journals/jama/fullarticle/272833", "snippet": "Tabulation reveals that there are nationally distributed at least 240 nasal vasoconstrictor compounds in the form of drops, sprays, inhalants and ointments."}, {"title": "NCT02285634 | The Effect of Intranasal Vasoconstrictor Medications ...", "url": "https://clinicaltrials.gov/study/NCT02285634", "snippet": "Classic teaching has been to avoid the use of these medications in patients with elevated blood pressures due to concerns of inducing hypertensive crisis."}, {"title": "Effect of Intranasal Vasoconstrictors on Blood Pressure", "url": "https://www.sciencedirect.com/science/article/pii/S0736467918306590", "snippet": "Intranasal vasoconstrictors did not significantly increase blood pressure in patients without a history of hypertension."}, {"title": "320 Do Intranasal Vasoconstrictors Increase Blood Pressure? A ...", "url": "https://www.annemergmed.com/article/S0196-0644(17)31291-X/fulltext", "snippet": "Intranasal vasoconstrictors do not significantly increase blood pressure in patients without a history of hypertension."}], "page_summaries": [{"url": "https://pubmed.ncbi.nlm.nih.gov/30195946/", "title": "Effect of Intranasal Vasoconstrictors on Blood Pressure: A Randomized, Double-Blind, Placebo-Controlled Trial - PubMed", "summary": "Intranasal vasoconstrictors are medications used in the treatment of epistaxis (nosebleeds). Common examples include phenylephrine (0.25%), oxymetazoline (0.05%), and epinephrine (e.g., in combination with lidocaine 1% at 1:100,000 concentration). A randomized, double-blind, placebo-controlled trial found that these agents do not significantly increase blood pressure in patients without a history of hypertension, supporting their use in emergency department settings for epistaxis regardless of elevated blood pressure."}, {"url": "https://jamanetwork.com/journals/jama/fullarticle/272833", "title": "THE USE AND ABUSE OF NASAL VASOCONSTRICTOR MEDICATIONS", "summary": "Intranasal vasoconstrictors are a widely used class of drugs, with at least 240 nationally distributed compounds in forms like drops, sprays, inhalants, and ointments. They are primarily based on sympathomimetic compounds, with ephedrine (isolated in 1887 from the herb ma huang) being the first such drug. Their increased use, driven by advertising, pharmaceutical promotion, and physician prescription, raises questions about justifiable use and potential disadvantages warranting reappraisal of indications."}, {"url": "https://clinicaltrials.gov/study/NCT02285634", "title": "Study Details | NCT02285634 | The Effect of Intranasal Vasoconstrictor Medications on Hemodynamic Parameters: A Randomized Double-blind, Placebo-controlled Trial. | ClinicalTrials.gov", "summary": "NO_RELEVANT_INFO"}, {"url": "https://www.sciencedirect.com/science/article/pii/S0736467918306590", "title": "Effect of Intranasal Vasoconstrictors on Blood Pressure: A Randomized, Double-Blind, Placebo-Controlled Trial", "summary": "Intranasal vasoconstrictors are medications applied topically to the nasal mucosa to reduce blood flow, commonly used in epistaxis treatment to facilitate examination and resolve bleeding. Commonly recommended agents include phenylephrine, oxymetazoline, and lidocaine with epinephrine, though their use for epistaxis is off-label. They have a precaution against use in patients with hypertension, but a randomized trial found no significant increase in blood pressure (mean arterial, systolic, diastolic) or heart rate compared to placebo in patients without hypertension, supporting their use in ED epistaxis management despite hypertension warnings."}, {"url": "https://www.annemergmed.com/article/S0196-0644(17)31291-X/fulltext", "title": "320 Do Intranasal Vasoconstrictors Increase Blood Pressure? A Randomized, Double-Blinded, Placebo-Controlled Trial", "summary": "Intranasal vasoconstrictors are medications used as first-line treatment for epistaxis (nosebleeds), with common examples including phenylephrine (0.25%), oxymetazoline (0.05%), and epinephrine (1:100,000 in lidocaine 1%). They act by constricting nasal blood vessels to control bleeding. While labeled with precautions for hypertensive patients due to case reports of hypertensive crisis, a randomized, double-blinded, placebo-controlled trial found they do not significantly increase blood pressure in patients without hypertension, supporting their use in epistaxis regardless of high blood pressure."}], "final_description": "Intranasal vasoconstrictors are a class of topically applied medications primarily used as first-line treatment for epistaxis (nosebleeds), acting by constricting nasal blood vessels to reduce blood flow, thereby controlling bleeding and facilitating examination of the nasal mucosa. Based on sympathomimetic compounds, common examples include phenylephrine (0.25%), oxymetazoline (0.05%), and epinephrine (often in combination with 1% lidocaine at a 1:100,000 concentration), with ephedrine—isolated in 1887 from the herb ma huang—being the first such agent. Available in various forms like drops, sprays, inhalants, and ointments, there are at least 240 nationally distributed compounds, though their widespread use, driven by advertising, pharmaceutical promotion, and physician prescription, has raised questions about justifiable indications and potential disadvantages. While labeled with precautions for hypertensive patients due to case reports of hypertensive crisis, randomized, double-blind, placebo-controlled trials have shown they do not significantly increase blood pressure (systolic, diastolic, or mean arterial) or heart rate in patients without hypertension, supporting their use in emergency department settings for epistaxis regardless of elevated blood pressure, even though their application for this purpose is often off-label.", "success": true, "from_cache": false}
{"keyword": "hypertension", "search_results": [{"title": "High blood pressure (hypertension) - Symptoms & causes", "url": "https://www.mayoclinic.org/diseases-conditions/high-blood-pressure/symptoms-causes/syc-20373410", "snippet": "High blood pressure is a common condition that affects the body's arteries. It's also called hypertension. If you have high blood pressure, the force of the ..."}, {"title": "Hypertension (High Blood Pressure): Symptoms and Causes", "url": "https://my.clevelandclinic.org/health/diseases/4314-hypertension-high-blood-pressure", "snippet": "High blood pressure, also called hypertension, means the force of blood pushing against your artery walls is consistently too high."}, {"title": "Hypertension - World Health Organization (WHO)", "url": "https://www.who.int/news-room/fact-sheets/detail/hypertension", "snippet": "Hypertension (high blood pressure) is when the pressure in your blood vessels is too high (140/90 mmHg or higher). It is common but can be serious if not ..."}, {"title": "What is High Blood Pressure? | American Heart Association", "url": "https://www.heart.org/en/health-topics/high-blood-pressure/the-facts-about-high-blood-pressure", "snippet": "High blood pressure is also known as hypertension. It happens when the force of your blood pushing against the walls of your blood vessels is too high."}, {"title": "High blood pressure in adults - hypertension - MedlinePlus", "url": "https://medlineplus.gov/ency/article/000468.htm", "snippet": "Untreated high blood pressure can lead to many medical problems. These include heart disease, stroke, kidney failure, eye problems, and other health issues."}], "page_summaries": [{"url": "https://my.clevelandclinic.org/health/diseases/4314-hypertension-high-blood-pressure", "title": "Why is Hypertension a Silent Killer?", "summary": "Hypertension, or high blood pressure, is a condition where blood pushes too forcefully against artery walls, forcing the heart to work harder. It is often asymptomatic (\"silent killer\") but can cause severe complications like heart attack, stroke, dementia, and kidney disease if untreated. Defined in the U.S. as systolic ≥130 mmHg or diastolic ≥80 mmHg, it has two main types: primary (genetic/familial/age-related) and secondary (due to medical conditions, medications, or substances). Treatment includes lifestyle modifications (e.g., DASH diet, reduced sodium, exercise) and medications (diuretics, ACE inhibitors, ARBs), with early diagnosis critical for preventing organ damage."}, {"url": "https://www.who.int/news-room/fact-sheets/detail/hypertension", "title": "Hypertension", "summary": "NO_RELEVANT_INFO"}, {"url": "https://medlineplus.gov/ency/article/000468.htm", "title": "High blood pressure in adults - hypertension: MedlinePlus Medical Encyclopedia", "summary": "Hypertension, the medical term for high blood pressure, is defined as sustained blood pressure readings of 130/80 mm Hg or higher, with elevated blood pressure ranging from 120-129/<80 mm Hg. Untreated, it increases risk of heart disease, stroke, kidney failure, and eye problems; most cases are essential (no identifiable cause), while secondary hypertension stems from conditions like chronic kidney disease, adrenal disorders, or medications. Diagnosis involves repeated blood pressure measurements, and management includes lifestyle modifications (e.g.,低盐 diet, exercise, weight management) and medications (often multiple agents) to prevent complications. Malignant hypertension, a severe form, presents with symptoms like headache, nausea, confusion, and vision changes."}], "final_description": "Hypertension, or high blood pressure, is a condition defined by sustained blood pressure readings of ≥130 mmHg systolic or ≥80 mmHg diastolic (with elevated blood pressure ranging from 120-129/<80 mmHg), characterized by excessive force of blood against artery walls, forcing the heart to work harder. It is often asymptomatic (\"silent killer\") but can lead to severe complications including heart attack, stroke, dementia, kidney disease/failure, and eye problems; a severe form, malignant hypertension, may present with symptoms like headache, nausea, confusion, and vision changes. The two main types are primary (essential), with no identifiable cause and linked to genetic, familial, or age-related factors, and secondary, stemming from underlying medical conditions (e.g., chronic kidney disease, adrenal disorders) or medications/substances. Diagnosis requires repeated blood pressure measurements, and management involves lifestyle modifications (e.g., DASH diet, reduced sodium, exercise, weight management) and medications (such as diuretics, ACE inhibitors, ARBs, often multiple agents), with early detection critical to preventing organ damage and complications.", "success": true, "from_cache": false}
{"keyword": "atorvastatin", "search_results": [{"title": "Atorvastatin (oral route) - Side effects & dosage - Mayo Clinic", "url": "https://www.mayoclinic.org/drugs-supplements/atorvastatin-oral-route/description/drg-20067003", "snippet": "Atorvastatin is used together with a proper diet to lower cholesterol and triglyceride (fats) levels in the blood."}, {"title": "Atorvastatin: a medicine to treat high blood cholestesterol - NHS", "url": "https://www.nhs.uk/medicines/atorvastatin/", "snippet": "Atorvastatin. Brand name: Lipitor. Find out how atorvastatin treats heart problems and how to take it."}, {"title": "Atorvastatin Uses, Dosage, Side Effects - Drugs.com", "url": "https://www.drugs.com/atorvastatin.html", "snippet": "Atorvastatin is a prescription medicine used to treat high cholesterol and to reduce the risk of heart attack, stroke, angina, and to decrease ..."}, {"title": "Atorvastatin: MedlinePlus Drug Information", "url": "https://medlineplus.gov/druginfo/meds/a600045.html", "snippet": "Atorvastatin is used together with diet, weight loss, and exercise to reduce the risk of heart attack and stroke and to decrease the chance that heart surgery ..."}, {"title": "Atorvastatin 2025 Prices, Coupons & Savings Tips - GoodRx", "url": "https://www.goodrx.com/atorvastatin?srsltid=AfmBOoo_5nG2NeuxQGuGnygycm3zbdO3Mcp2Ljz8u0GbTnYT6lQavooP", "snippet": "Atorvastatin (Lipitor) is an inexpensive drug that lowers levels of cholesterol and triglycerides in the blood. Atorvastatin may also reduce the risk of heart ..."}], "page_summaries": [{"url": "https://www.nhs.uk/medicines/atorvastatin/", "title": "Atorvastatin: a medicine to treat high blood cholestesterol", "summary": "Atorvastatin is a medicine used to treat high blood cholesterol and heart problems, with the brand name Lipitor. It is indicated for conditions such as angina, cardiovascular disease, heart attack, and stroke. Information on its use includes details about who can/cannot take it, administration methods, side effects, interactions with other substances, and considerations during pregnancy/breastfeeding."}, {"url": "https://medlineplus.gov/druginfo/meds/a600045.html", "title": "Atorvastatin: MedlinePlus Drug Information", "summary": "Atorvastatin is an HMG-CoA reductase inhibitor (statin) used with diet, weight loss, and exercise to reduce heart attack/stroke risk, lower LDL cholesterol/triglycerides, and increase HDL cholesterol, also indicated for familial heterozygous hypercholesterolemia in 10-17-year-olds. It works by slowing cholesterol production, preventing arterial buildup and atherosclerosis. Administered orally as tablets (with/without food) or suspension (empty stomach), once daily, with dosage adjustments based on response; continued use is necessary even if asymptomatic. Contraindicated in liver disease, pregnancy, and breastfeeding; potential interactions with medications like cimetidine and niacin, and side effects including muscle pain, liver enzyme elevation, and allergic reactions require monitoring."}, {"url": "https://www.goodrx.com/atorvastatin?srsltid=AfmBOoo_5nG2NeuxQGuGnygycm3zbdO3Mcp2Ljz8u0GbTnYT6lQavooP", "title": "Atorvastatin 2025 Prices, Coupons & Savings Tips", "summary": "Atorvastatin is a medication that lowers blood levels of cholesterol and triglycerides. It may also reduce the risk of heart attack or stroke in patients with risk factors for heart disease. It is the generic version of Lipitor and has been available in generic and brand versions since 2011. It is commonly used and covered by most Medicare and insurance plans."}], "final_description": "Atorvastatin, a generic HMG-CoA reductase inhibitor (statin) marketed under the brand name Lipitor (available since 2011 and covered by most Medicare/insurance plans), is used alongside diet, weight loss, and exercise to lower LDL cholesterol and triglycerides, increase HDL cholesterol, and reduce the risk of heart attack, stroke, and cardiovascular disease, with additional indications including angina, familial heterozygous hypercholesterolemia in 10-17-year-olds, and prevention of arterial buildup/atherosclerosis. Its mechanism involves slowing cholesterol production in the liver, thereby preventing atherosclerotic plaque formation. Administered orally as tablets (with or without food) or suspension (on an empty stomach) once daily, dosage is adjusted based on response, and continued use is necessary even when asymptomatic. Contraindications include liver disease, pregnancy, and breastfeeding, while potential interactions with medications like cimetidine and niacin, and side effects such as muscle pain, liver enzyme elevation, and allergic reactions, require monitoring.", "success": true, "from_cache": false}
{"keyword": "type 2 diabetes mellitus", "search_results": [{"title": "Type 2 Diabetes - StatPearls - NCBI Bookshelf", "url": "https://www.ncbi.nlm.nih.gov/books/NBK513253/", "snippet": "Diabetes mellitus (DM) is a chronic metabolic disorder characterized by persistent hyperglycemia. It may be due to impaired insulin secretion, resistance to ..."}, {"title": "Type 2 diabetes - Symptoms and causes - Mayo Clinic", "url": "https://www.mayoclinic.org/diseases-conditions/type-2-diabetes/symptoms-causes/syc-20351193", "snippet": "Type 2 diabetes happens when the body cannot use insulin correctly and sugar builds up in the blood. It was once called adult-onset diabetes."}, {"title": "Type 2 Diabetes: What It Is, Causes, Symptoms & Treatment", "url": "https://my.clevelandclinic.org/health/diseases/21501-type-2-diabetes", "snippet": "Type 2 diabetes (T2D) is a chronic condition that happens when you have constant high blood sugar. This happens because your body can't use insulin properly."}, {"title": "Understanding Type 2 Diabetes | ADA", "url": "https://diabetes.org/about-diabetes/type-2", "snippet": "Symptoms of Type 2 Diabetes · Urinating often · Feeling very thirsty · Feeling very hungry—even though you are eating · Extreme fatigue · Blurry vision · Cuts/bruises ..."}, {"title": "Type 2 Diabetes Mellitus - Harvard Health", "url": "https://www.health.harvard.edu/diseases-and-conditions/type-2-diabetes-mellitus-a-to-z", "snippet": "Type 2 diabetes is a chronic disease. It is characterized by high levels of sugar in the blood. Type 2 diabetes is also called type 2 diabetes mellitus and ..."}], "page_summaries": [{"url": "https://www.ncbi.nlm.nih.gov/books/NBK513253/", "title": "Type 2 Diabetes", "summary": "Type 2 diabetes mellitus (T2DM) accounts for ~90% of diabetes cases, characterized by insulin resistance (diminished response to insulin) with progressive beta-cell dysfunction, initially compensated by increased insulin secretion, later leading to insufficient insulin production. It primarily affects adults >45 years but is increasingly seen in younger individuals due to obesity, physical inactivity, and energy-dense diets. Clinical manifestations include polyuria, polydipsia, fatigue, infections, delayed wound healing, and neuropathy; complications include microvascular (retinopathy, nephropathy, neuropathy) and macrovascular (2-4x increased cardiovascular disease risk) issues. Management includes lifestyle modifications (diet, exercise, weight loss), first-line metformin, and additional therapies like SGLT2 inhibitors or GLP-1 receptor agonists (especially with cardiovascular disease), targeting HbA1C <7% to reduce complications."}, {"url": "https://www.mayoclinic.org/diseases-conditions/type-2-diabetes/symptoms-causes/syc-20351193", "title": "Type 2 diabetes - Symptoms and causes", "summary": "Type 2 diabetes mellitus is a condition where the body cannot use insulin correctly (insulin resistance) and/or the pancreas fails to produce enough insulin, leading to elevated blood glucose levels. Symptoms include increased thirst, urination, hunger, weight loss, fatigue, blurred vision, slow-healing sores, and numbness/tingling in extremities, often developing gradually. Risk factors include obesity, physical inactivity, family history, older age, prediabetes, and certain ethnicities. Complications affect major organs (heart, nerves, kidneys, eyes) and include heart disease, neuropathy, kidney disease, and retinopathy. Management involves lifestyle modifications (weight loss, diet, exercise) and may require diabetes medications or insulin therapy; there is no cure."}, {"url": "https://my.clevelandclinic.org/health/diseases/21501-type-2-diabetes", "title": "Is Type 2 Diabetes Reversible?", "summary": "Type 2 diabetes mellitus is a chronic condition characterized by persistent high blood sugar due to insulin resistance (impaired cellular response to insulin) and/or insufficient insulin production. Symptoms develop gradually and include increased thirst, frequent urination, fatigue, slow wound healing, and numbness in extremities; females may experience recurrent vaginal yeast or urinary tract infections. Diagnosis is via blood tests (fasting plasma glucose ≥126 mg/dL, random plasma glucose ≥200 mg/dL, or A1C ≥6.5%). Management involves lifestyle modifications (diet, exercise), medications (e.g., metformin, GLP-1 agonists, insulin), and glucose monitoring to prevent complications like cardiovascular disease, neuropathy, and kidney damage; it requires lifelong management as there is no cure."}, {"url": "https://www.health.harvard.edu/diseases-and-conditions/type-2-diabetes-mellitus-a-to-z", "title": "Type 2 Diabetes Mellitus - Harvard Health", "summary": "Type 2 diabetes mellitus is a chronic disease characterized by high blood sugar levels due to insulin resistance, where cells fail to respond normally to insulin, and progressive pancreatic beta-cell dysfunction leading to insufficient insulin production. Risk factors include family history and obesity; symptoms include polyuria, polydipsia, polyphagia, weight loss, and increased infection susceptibility, with potential life-threatening complications like hyperosmolar syndrome, atherosclerosis, retinopathy, neuropathy, nephropathy, and foot ulcers. Diagnosis is via blood tests (fasting plasma glucose ≥126 mg/dL, HbA1C ≥6.5%, etc.), and treatment involves lifestyle modifications (diet, exercise, weight loss), medications (metformin, GLP-1 agonists, SGLT-2 inhibitors, insulin), and management of comorbidities to prevent complications. It is a lifelong condition, though blood sugar normalization may be achieved with early lifestyle interventions, and progression often requires additional treatment over time."}], "final_description": "Type 2 diabetes mellitus (T2DM) is a chronic condition characterized by persistent hyperglycemia resulting from insulin resistance (impaired cellular response to insulin) and progressive pancreatic beta-cell dysfunction, initially compensated by increased insulin secretion but later leading to insufficient production, accounting for ~90% of diabetes cases. Pathophysiologically, it arises from a combination of genetic factors (family history) and lifestyle influences (obesity, physical inactivity, energy-dense diets), primarily affecting adults >45 years but increasingly seen in younger individuals. Clinical manifestations develop gradually and include polyuria, polydipsia, polyphagia, fatigue, weight loss, blurred vision, slow wound healing, neuropathy (numbness/tingling in extremities), recurrent infections (e.g., vaginal yeast, urinary tract), and increased susceptibility to complications like microvascular (retinopathy, nephropathy, neuropathy) and macrovascular (2-4x higher cardiovascular disease risk, atherosclerosis) damage, as well as potentially life-threatening hyperosmolar syndrome and foot ulcers. Diagnosis is confirmed via blood tests, including fasting plasma glucose ≥126 mg/dL, random plasma glucose ≥200 mg/dL, or HbA1C ≥6.5%. Management requires lifelong intervention, starting with lifestyle modifications (diet, exercise, weight loss), followed by medications such as metformin (first-line), GLP-1 receptor agonists, SGLT2 inhibitors (especially with cardiovascular disease), or insulin, with the goal of targeting HbA1C <7% to reduce complications; while there is no cure, early lifestyle interventions may normalize blood sugar, though progression often necessitates additional treatments over time.", "success": true, "from_cache": false}
{"keyword": "Coats disease", "search_results": [{"title": "Coats Disease - EyeWiki", "url": "https://eyewiki.org/Coats_Disease", "snippet": "Coats disease is a telangiectatic neovascular disease of the retina of unknown etiology. It usually affects one eye rather than both eyes."}, {"title": "Coats Disease: Symptoms, Stages & Treatment - Cleveland Clinic", "url": "https://my.clevelandclinic.org/health/diseases/coats-disease", "snippet": "Coats disease is a rare condition that causes blood vessels in your child's retina to leak fluid in the inside of their eye."}, {"title": "Coats' Disease - Prevent Blindness", "url": "https://preventblindness.org/coats-disease/", "snippet": "Coats' disease is a rare eye condition usually affecting only one eye. Coats' disease mostly occurs in young males and can cause blindness if left ..."}, {"title": "Coats disease: An overview of classification, management and ...", "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6552590/", "snippet": "Coats disease is an idiopathic retinal vascular disorder with retinal telangiectasia with intraretinal and/or subretinal exudation without appreciable retinal ..."}, {"title": "Coats' disease | Great Ormond Street Hospital", "url": "https://www.gosh.nhs.uk/conditions-and-treatments/conditions-we-treat/coats-disease/", "snippet": "Coats disease can lead to blindness or uncontrolled pressure inside the eye, which can sometimes cause pain. Rarely this can mean the eye needs to be removed."}], "page_summaries": [{"url": "https://eyewiki.org/Coats_Disease", "title": "Coats Disease - EyeWiki", "summary": "Coats disease is an idiopathic, unilateral (95%) retinal disorder characterized by telangiectatic and aneurysmal retinal vessels (primarily temporal) that leak, leading to intraretinal/subretinal exudation and potential exudative retinal detachment. It predominantly affects males (≥3:1) under 8 years, with features including decreased visual acuity, strabismus, and hard exudates; staging systems (e.g., Shields') classify severity by extent of telangiectasia, exudation, and retinal detachment. Treatment options include observation, laser photocoagulation, cryotherapy, vitreoretinal surgery, or anti-VEGF therapy, with prognosis dependent on disease stage and patient age."}, {"url": "https://my.clevelandclinic.org/health/diseases/coats-disease", "title": "What Is Coats Disease?", "summary": "Coats disease is a rare condition characterized by abnormal development of retinal blood vessels, causing them to dilate, twist, and leak fluid into the retina, typically affecting one eye (unilaterally) and most commonly diagnosed in children and teens. Symptoms may include worsening vision, crossed eyes (strabismus), eye pain, or a white/silvery pupil (leukocoria), with progression through 5 stages from mild (stage 1: asymptomatic abnormal vessels) to severe (stage 5: blindness). Treatment depends on stage, including monitoring for early stages, cryotherapy, anti-VEGF injections, or surgery for retinal detachment in advanced stages, with early diagnosis improving outcomes."}, {"url": "https://preventblindness.org/coats-disease/", "title": "Coats' Disease - Prevent Blindness", "summary": "NO_RELEVANT_INFO"}, {"url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6552590/", "title": "Coats disease: An overview of classification, management and outcomes", "summary": "Coats disease is an idiopathic, sporadic retinal vascular disorder characterized by retinal telangiectasia with intraretinal and/or subretinal exudation, typically presenting unilaterally in young males (first/second decade), with younger patients showing more severe disease and poorer visual outcomes. Pathogenesis involves blood-retinal barrier breakdown due to endothelial and pericyte abnormalities, leading to vessel dilation, exudation, and potential retinal detachment. Clinical features include vision loss, strabismus, xanthocoria, and fundus findings of \"light bulb\" telangiectasias and yellow exudation; complications include neovascular glaucoma and retinal macrocysts. Management has shifted from enucleation to conservative approaches, with laser photocoagulation, cryotherapy, and vitreoretinal surgery for retinal detachment, plus anti-VEGF agents as adjuvant therapy to control exudation and preserve vision."}, {"url": "https://www.gosh.nhs.uk/conditions-and-treatments/conditions-we-treat/coats-disease/", "title": "Coats' disease", "summary": "Coats disease is a rare eye condition characterized by abnormal, leaky blood vessels in the retina, leading to fluid accumulation and potential retinal detachment, which can damage vision, especially if involving the macula. It primarily affects males under 10 years (but can occur in adulthood), is unilateral in over 90% of cases, and has an incidence of 1 in 100,000 people; its cause is unknown, though mutations in the NDP gene may be implicated, and it is not inherited. Symptoms include painless vision loss or a white/yellow pupil; diagnosis involves ophthalmic examination, fundus fluorescein angiogram, and imaging. Treatments aim to prevent vision deterioration and include laser therapy, anti-VEGF injections (e.g., bevacizumab), and surgery for retinal detachment, though there is no cure; complications may include blindness, elevated eye pressure, or rarely enucleation."}], "final_description": "Coats disease is a rare, idiopathic, sporadic retinal vascular disorder characterized by abnormal development of retinal blood vessels, leading to telangiectasia, aneurysmal dilation, and leakage, which results in intraretinal/subretinal exudation and potential exudative retinal detachment. Pathogenesis involves blood-retinal barrier breakdown due to endothelial and pericyte abnormalities, with no clear inheritance pattern, though mutations in the NDP gene may be implicated. It predominantly affects males (≥3:1) in the first decade of life (under 10 years), is unilateral in over 90% of cases, and presents with clinical features such as decreased visual acuity, strabismus, leukocoria/xanthocoria, and fundus findings of \"light bulb\" telangiectasias and yellow exudation; complications include neovascular glaucoma, retinal macrocysts, and vision loss, with younger patients typically experiencing more severe disease and poorer outcomes. Staging systems (e.g., Shields') classify severity based on the extent of telangiectasia, exudation, and retinal detachment, ranging from asymptomatic abnormal vessels (stage 1) to blindness (stage 5). Treatment approaches, which aim to preserve vision and prevent progression, include observation for early stages, laser photocoagulation, cryotherapy, anti-VEGF therapy (e.g., bevacizumab) to control exudation, and vitreoretinal surgery for retinal detachment, with early diagnosis significantly improving prognosis.", "success": true, "from_cache": false}
{"keyword": "atrial fibrillation", "search_results": [{"title": "Atrial fibrillation - Symptoms and causes - Mayo Clinic", "url": "https://www.mayoclinic.org/diseases-conditions/atrial-fibrillation/symptoms-causes/syc-20350624", "snippet": "Atrial fibrillation (AFib) is an irregular and often very rapid heart rhythm. An irregular heart rhythm is called an arrhythmia."}, {"title": "Atrial Fibrillation (AFib): Symptoms & Treatment - Cleveland Clinic", "url": "https://my.clevelandclinic.org/health/diseases/16765-atrial-fibrillation-afib", "snippet": "AFib (atrial fibrillation) is an irregular heart rhythm that begins in your heart's upper chambers. Symptoms include fatigue, heart palpitations and ..."}, {"title": "What is Atrial Fibrillation? - American Heart Association", "url": "https://www.heart.org/en/health-topics/atrial-fibrillation/what-is-atrial-fibrillation-afib-or-af", "snippet": "Atrial fibrillation is an irregular heartbeat, or arrhythmia. Atrial fibrillation, also known as AFib or AF, can lead to blood clots, stroke, heart failure and ..."}, {"title": "What Is Atrial Fibrillation? - NHLBI - NIH", "url": "https://www.nhlbi.nih.gov/health/atrial-fibrillation", "snippet": "Atrial fibrillation, also known as A-fib or AF, affects more than 2 million adults in the United States and is one of the most common types of arrhythmias."}, {"title": "Atrial Fibrillation | AFib - MedlinePlus", "url": "https://medlineplus.gov/atrialfibrillation.html", "snippet": "Atrial fibrillation, also known as AFib or AF, is one of the most common types of arrhythmias. Arrhythmias are problems with the rate or rhythm of your ..."}], "page_summaries": [{"url": "https://www.mayoclinic.org/diseases-conditions/atrial-fibrillation/symptoms-causes/syc-20350624", "title": "Atrial fibrillation - Symptoms and causes", "summary": "Atrial fibrillation (AFib) is an irregular and often rapid heart rhythm disorder (arrhythmia) where the heart's upper chambers (atria) beat chaotically and out of sync with the lower chambers (ventricles), due to chaotic electrical signals overwhelming the AV node. It increases the risk of blood clots, stroke, heart failure, and other complications, with symptoms including palpitations, chest pain, dizziness, fatigue, shortness of breath, and weakness (some may be asymptomatic). Types include paroxysmal (occasional, self-resolving), persistent (constant, requires treatment), long-standing persistent (over 12 months), and permanent (uncorrectable). Causes include heart structure changes (e.g., valve disease, hypertension, congenital defects), thyroid disease, sleep apnea, lifestyle factors (alcohol/caffeine excess, smoking), and certain medications; treatments may involve medicines, rhythm-resetting therapy, or procedures to block faulty signals."}, {"url": "https://www.nhlbi.nih.gov/health/atrial-fibrillation", "title": "What Is Atrial Fibrillation?", "summary": "Atrial fibrillation (A-fib/AF) is a common arrhythmia characterized by irregular and often rapid heartbeats, where the heart's upper and lower chambers fail to coordinate effectively, leading to incomplete filling and reduced blood pumping. Symptoms may include fatigue, lightheadedness, palpitations, chest pain, or it may be asymptomatic; complications include blood clots, stroke, and heart failure. Risk increases with age, and while it may resolve spontaneously, it often becomes chronic, with episodes increasing in frequency and duration over time. Treatment options include medications, medical procedures, and lifestyle changes to restore normal rhythm, control heart rate, manage symptoms, and prevent complications."}, {"url": "https://medlineplus.gov/atrialfibrillation.html", "title": "Atrial Fibrillation", "summary": "Atrial fibrillation (AFib) is a common arrhythmia characterized by irregular and often rapid heartbeats due to disrupted electrical signaling, causing inefficient coordination between the heart's upper and lower chambers. Symptoms include dizziness, fatigue, palpitations, and chest pain; untreated, it increases stroke, heart failure, and blood clot risks. Risk factors include aging, hypertension, heart disease, family history, and lifestyle factors like alcohol use. Diagnosis involves medical history, physical exam, EKG, echocardiogram, and heart monitors. Treatments include blood thinners, antiarrhythmic medications, lifestyle modifications (e.g., heart-healthy diet, exercise), and procedures like cardioversion or catheter ablation."}], "final_description": "Atrial fibrillation (AFib) is a common cardiac arrhythmia characterized by irregular and often rapid heartbeats resulting from chaotic electrical signals in the heart's upper chambers (atria), which overwhelm the AV node and disrupt coordinated contraction with the lower chambers (ventricles), leading to inefficient filling and reduced blood pumping. Clinical features include palpitations, chest pain, dizziness, fatigue, shortness of breath, weakness, or may be asymptomatic, while complications encompass increased risks of blood clots, stroke, and heart failure. Risk factors include aging, hypertension, structural heart changes (e.g., valve disease, congenital defects), thyroid disease, sleep apnea, family history, and lifestyle factors such as excess alcohol/caffeine, smoking, or poor diet. Diagnosis involves medical history, physical examination, and tests like EKG, echocardiogram, and heart monitors. Treatment strategies aim to manage symptoms, restore normal rhythm, control heart rate, and prevent complications, including blood thinners, antiarrhythmic medications, lifestyle modifications (e.g., heart-healthy diet, exercise), and procedures such as cardioversion or catheter ablation. Types of AFib include paroxysmal (occasional, self-resolving), persistent (requires treatment), long-standing persistent (over 12 months), and permanent (uncorrectable), with episodes often increasing in frequency and duration over time, potentially becoming chronic.", "success": true, "from_cache": false}
