{"url": "https://my.clevelandclinic.org/health/diseases/7104-diabetes", "title": "Diabetes", "content": "Diabetes is a chronic condition characterized by high blood glucose (hyperglycemia) due to insufficient insulin production (by the pancreas), insulin resistance, or both. Common types include Type 2 (most prevalent, involving insulin resistance), Type 1 (autoimmune destruction of insulin-producing cells), prediabetes (intermediate stage), and gestational diabetes (develops during pregnancy). Symptoms may include polydipsia, polyuria, fatigue, blurred vision, and slow-healing wounds; complications include cardiovascular disease, neuropathy, nephropathy, and retinopathy. Management involves blood glucose monitoring, lifestyle modifications (diet, exercise), oral medications (e.g., metformin), and insulin therapy, with goals to prevent complications and maintain glycemic control."}
{"url": "https://diabetes.org/", "title": "Diabetes Research, Education, Advocacy | ADA", "content": "Diabetes is a condition with multiple types, including Type 1, Type 2, and Gestational Diabetes. Key aspects covered include warning signs, symptoms, prediabetes (a precursor state), prevention strategies, complications, and management through education, treatment, and lifestyle adjustments. Statistics indicate over 38 million Americans are affected, with 1.2 million new diagnoses annually and 97.6 million adults living with prediabetes. Tools like the Type 2 Diabetes Risk Test and resources for healthy eating, fitness, and medication management are available to support individuals living with diabetes."}
{"url": "https://www.mayoclinic.org/diseases-conditions/diabetes/symptoms-causes/syc-20371444", "title": "Diabetes - Symptoms and causes", "content": "Diabetes mellitus is a group of diseases affecting blood sugar (glucose) utilization, characterized by excess blood sugar due to insufficient insulin or insulin ineffectiveness, leading to serious health complications. Chronic types include type 1 (autoimmune, insulin deficiency) and type 2 (insulin resistance, more common), while reversible forms are prediabetes (elevated but sub-diabetic glucose) and gestational diabetes (during pregnancy). Symptoms may include polyuria, polydipsia, unintended weight loss, fatigue, blurred vision, slow-healing sores, and infections, with type 1 symptoms typically acute and severe, and type 2/prediabetes/gestational often asymptomatic initially. Long-term complications involve cardiovascular disease, neuropathy, nephropathy, retinopathy, and increased infection risk, with prevention/treatment focusing on lifestyle modifications (diet, exercise, weight management) and medications (e.g., metformin for prediabetes/type 2)."}
{"url": "https://www.who.int/news-room/fact-sheets/detail/diabetes", "title": "Diabetes", "content": "NO_RELEVANT_INFO"}
{"url": "https://www.niddk.nih.gov/health-information/diabetes/overview/what-is-diabetes", "title": "What Is Diabetes?", "content": "Diabetes is a disease characterized by abnormally high blood glucose levels due to insufficient insulin production, impaired insulin action, or both, preventing glucose from entering cells for energy. Common types include type 1 (autoimmune destruction of pancreatic insulin-producing cells, requiring daily insulin), type 2 (insulin resistance with potential insufficient insulin, linked to obesity/family history), gestational (develops during pregnancy, often resolves post-delivery but increases future type 2 risk), and prediabetes (elevated glucose not meeting diabetes criteria, high type 2 risk). It increases risk of damage to eyes, kidneys, nerves, heart, and certain cancers; management involves controlling blood glucose, blood pressure, and cholesterol, with type 2 potentially preventable/delayable via lifestyle modifications."}
{"url": "https://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/symptoms-causes/syc-20353447", "title": "Urinary tract infection (UTI) - Symptoms and causes", "content": "A urinary tract infection (UTI) is an infection affecting any part of the urinary system (kidneys, ureters, bladder, urethra), most commonly involving the lower tract (bladder, urethra). It occurs when bacteria (often E. coli) enter the urethra and multiply in the bladder, with women at higher risk due to shorter urethra and hormonal changes. Symptoms include dysuria, urinary urgency/frequency, hematuria, and pelvic pain; kidney involvement causes back pain, fever, nausea/vomiting. UTIs are treated with antibiotics, and complications like kidney damage or sepsis may occur if untreated. Prevention includes fluid intake, avoiding irritants, and managing risk factors like constipation or incomplete bladder emptying."}
{"url": "https://my.clevelandclinic.org/health/diseases/9135-urinary-tract-infections", "title": "Urinary Tract Infection (UTI)", "content": "A urinary tract infection (UTI) is an infection of the urinary system, involving the urethra (urethritis), bladder (cystitis), or kidneys (pyelonephritis), most commonly caused by bacteria like E. coli. Symptoms include frequent urination, dysuria, flank/abdominal pain, cloudy/foul-smelling urine, and may progress to fever, chills, or nausea if involving the kidneys. Diagnosis is via urinalysis (detecting nitrites, leukocyte esterase) and urine culture, with treatment typically involving antibiotics such as nitrofurantoin, sulfamethoxazole/trimethoprim, or cephalexin; completion of the full antibiotic course is critical to prevent recurrence or antibiotic resistance. Prevention strategies include good hygiene (front-to-back wiping), adequate fluid intake, urinating before/after sex, and avoiding irritants like spermicides or tight clothing."}
{"url": "https://www.urologyhealth.org/urology-a-z/u/urinary-tract-infections-in-adults", "title": "Urinary Tract Infection(UTI): Symptoms, Diagnosis & Treatment", "content": "A urinary tract infection (UTI) is an infection caused by germs (usually bacteria) entering the bladder, urethra, or kidneys. Symptoms include burning during urination, frequent urination, cloudy/foul-smelling urine, lower abdominal pain, and, if kidneys are involved, fever, chills, nausea, or back pain. Risk factors include female anatomy (shorter urethra), sexual activity, postmenopausal estrogen decline, diabetes, urinary blockages, and catheter use. Diagnosis involves urine testing and culture; treatment typically uses antibiotics (3-7 days for uncomplicated cases), with IV antibiotics for kidney involvement. Prevention strategies include increased fluid intake, avoiding spermicides, cranberry products (for some), vaginal estrogen (postmenopausal women), and methenamine hippurate (prescription)."}
{"url": "https://www.ncbi.nlm.nih.gov/books/NBK470195/", "title": "Uncomplicated Urinary Tract Infections", "content": "A urinary tract infection (UTI) is a bacterial infection typically involving the lower urinary tract (bladder and associated structures), caused primarily by _Escherichia coli_ ascending from the perineum/rectum. Key symptoms include urinary frequency, urgency, dysuria, and suprapubic discomfort; diagnosis relies on clinical history, urinalysis (detecting nitrites, leukocyte esterase, pyuria), and urine culture (≥1000 CFU/mL in symptomatic patients). Treatment involves first-line antibiotics like nitrofurantoin, trimethoprim/sulfamethoxazole, or fosfomycin, with duration 3-7 days (longer for men), aiming to relieve symptoms and prevent progression to pyelonephritis. Risk factors include female sex, sexual activity, urinary catheter use, and antibiotic exposure."}
{"url": "https://www.cdc.gov/uti/about/index.html", "title": "Urinary Tract Infection Basics", "content": "A urinary tract infection (UTI) is a common infection caused by bacteria (often from the skin or rectum) entering the urethra and infecting the urinary tract, which includes the bladder, urethra, and kidneys. Common types are bladder infections (cystitis, most common) and kidney infections (pyelonephritis, more serious). Symptoms include pain/burning during urination, frequent urination, and for kidney infections, fever, chills, and back pain. Risk factors include female gender (shorter urethra), previous UTI, sexual activity, and age (young children/older adults). Treatment involves antibiotics prescribed by a healthcare provider; prevention includes urinating after sex, staying hydrated, and proper hygiene (e.g., front-to-back wiping)."}
